src/cf/DataProcessors/пр_ПоддержкаОтраслевыхРешений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>пр_ПоддержкаОтраслевыхРешений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаРегламентированногоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаименованияДляПечатныхФорм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаименованияДляПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИМНС</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Comment>(Регл) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИМНС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПлательщикаПриПеречисленииНалогов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСчетовФактур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЛоготип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФаксимильнаяПечать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКонтактнойИнформации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/пр_ПоддержкаОтраслевыхРешений/Forms/РегистрационнаяАнкета/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Регистрируем событие
	пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики("ПоддержкаОтраслевыхРешений.РегистрационнаяАнкета");
	
	// Установим правило проверки кодов организации
	КонтрольКорректностиКодов = ИСТИНА;
	
	// Производим получение регистрационных данных
	ПрочитатьДанные();
	
	// Подготовим список выбора рег.номеров
	СписокЛицензий = ЭтотОбъект.Элементы.РегНомер.СписокВыбора;
	СписокЛицензий.Очистить();
	пр_ПоддержкаОтраслевыхРешений.ПолучитьПараметрыЛицензий(ЭтотОбъект, СписокЛицензий);
	
	ЭтотОбъект.Элементы.РегНомер.КнопкаВыпадающегоСписка = (СписокЛицензий.Количество() > 0);
	Если ПустаяСтрока(ЭтотОбъект.РегНомер) И СписокЛицензий.Количество() > 0 Тогда
		ЭтотОбъект.РегНомер = СписокЛицензий[0].Значение;
	КонецЕсли;
	
	// Если есть стандартный механизм авторизации на ИТС, то отображать кнопку выбора и запретить редактирование текста
	ОбъектМетаданныхПодключениеИнтернетПоддержки = Метаданные.НайтиПоПолномуИмени("ОбщаяФорма.ПодключениеИнтернетПоддержки");
	Элементы.ЛогинИТС.КнопкаВыбора = (ОбъектМетаданныхПодключениеИнтернетПоддержки<>Неопределено);
	
	// Если есть реквизит ИНН у спр. Организации, то данные подтягиваются при выборе элемента справочника
	ОбъектМетаданныхОрганизации = Метаданные.НайтиПоПолномуИмени("Справочник.Организации");
	ЕстьОрганизации             = (ОбъектМетаданныхОрганизации<>Неопределено);
	ЕстьРеквизитИНН             = (ЕстьОрганизации И ОбъектМетаданныхОрганизации.Реквизиты.Найти("ИНН") <> Неопределено);
	ЕстьРеквизитКПП             = (ЕстьОрганизации И ОбъектМетаданныхОрганизации.Реквизиты.Найти("КПП") <> Неопределено);
	ЕстьПодсистемаОрганизации   = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Организации");
	Элементы.ИНН.КнопкаВыбора   = (ЕстьРеквизитИНН ИЛИ ЕстьОрганизации И ЕстьПодсистемаОрганизации);
	
	ПроверяемыеОбъекты = Новый Массив();
	ПроверяемыеОбъекты.Добавить("Сотрудники");
	ПроверяемыеОбъекты.Добавить("ФизическиеЛица");
	ПроверяемыеОбъекты.Добавить("Пользователи");
	
	ОбъектыСодержащиеКонтактнуюИнформацию = Новый СписокЗначений();
	Для каждого ИмяОбъекта Из ПроверяемыеОбъекты Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник."+ИмяОбъекта);
		Если ОбъектМетаданных=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьКонтактнаяИнформация = УправлениеКонтактнойИнформацией.СодержитКонтактнуюИнформацию(Тип("СправочникСсылка."+ИмяОбъекта));
		ОбъектыСодержащиеКонтактнуюИнформацию.Добавить(ИмяОбъекта,, ЕстьКонтактнаяИнформация);
		
	КонецЦикла;
	
	Если ОбъектыСодержащиеКонтактнуюИнформацию.Количество() > 0 Тогда
		
		Элементы.Руководитель.КнопкаВыбора = Истина;
		
		ИмяОбъектаРуководитель = ОбъектыСодержащиеКонтактнуюИнформацию[0].Значение;
		Для каждого Элемент Из ОбъектыСодержащиеКонтактнуюИнформацию Цикл
			Если Элемент.Пометка Тогда
				ИмяОбъектаРуководитель = Элемент.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Определим может ли база отправлять регистрационные данные
	ЭтотОбъект.ВозможнаОтправкаСведений = НЕ ОбщегоНазначения.РазделениеВключено();
	
	// По умолчанию скроем поля затрагивающие персональные данные
	ЭтотОбъект.ПерсональнаяИнформация = ЛОЖЬ;
	
	// Вызываем переопределяемый обработчик события
	пр_ПоддержкаОтраслевыхРешенийПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// Производим управление видимостью полей с персональной информацией
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если ЭтотОбъект.ВозможнаОтправкаСведений И НЕ ЭтотОбъект.СогласиеОтправитьСведенияОПродукте Тогда
		ТекстСообщения = НСтр("ru = 'Примите условия Политики конфиденциальности.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "СогласиеОтправитьСведенияОПродукте",, Отказ);
	КонецЕсли;
	
	Если НЕ КППСоответствуетТребованиям(ЭтотОбъект.КПП, КонтрольКорректностиКодов, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "КПП",, Отказ);
	КонецЕсли;
	
	Если НЕ ИННСоответствуетТребованиям(ЭтотОбъект.ИНН, КонтрольКорректностиКодов, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ИНН",, Отказ);
	КонецЕсли;
	
	Если НЕ РегНомерСоответствуетТребованиям(ЭтотОбъект.РегНомер, ИСТИНА, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "РегНомер",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РегНомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЕстьОшибка = НЕ РегНомерСоответствуетТребованиям(Текст, КонтрольКорректностиКодов, Элемент.Подсказка);
	Элемент.ОтметкаНезаполненного = ПустаяСтрока(Текст) ИЛИ ЕстьОшибка;
	
КонецПроцедуры

&НаКлиенте
Процедура ИНННачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ ЕстьОрганизации Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ОткрытьФорму("Справочник."+"Организации"+".ФормаВыбора", Новый Структура("РежимВыбора", Истина), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИННОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ПараметрыОрганизации = ПолучитьПараметрыОрганизации(ВыбранноеЗначение);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыОрганизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ИННОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЕстьОшибка = НЕ ИННСоответствуетТребованиям(Текст, КонтрольКорректностиКодов, Элемент.Подсказка);
	Элемент.ОтметкаНезаполненного = ПустаяСтрока(Текст) ИЛИ ЕстьОшибка;
	
КонецПроцедуры

&НаКлиенте
Процедура КППОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЕстьОшибка = НЕ КППСоответствуетТребованиям(Текст, КонтрольКорректностиКодов, Элемент.Подсказка);
	Элемент.ОтметкаНезаполненного = ЕстьОшибка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЛогинИТС(Результат, ДопПараметры=Неопределено) Экспорт
	
	Если Результат=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ЛогинИТС = Результат.Логин;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛогинИТСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		Возврат
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЛогинИТС", ЭтотОбъект);
	
	МодульИнтернетПоддержкаПользователейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
	МодульИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораРуководителяНаСервере(Результат)
	
	// заполним ФИО выбранного руководителя
	ЭтотОбъект.Руководитель = СокрЛП(Результат);
	
	// подтягивание контактных данных из справочника
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	Если НЕ МодульУправлениеКонтактнойИнформацией.СодержитКонтактнуюИнформацию(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЭлектроннаяПочта = МодульУправлениеКонтактнойИнформацией.ТипКонтактнойИнформацииПоНаименованию("АдресЭлектроннойПочты");
	ТипТелефон          = МодульУправлениеКонтактнойИнформацией.ТипКонтактнойИнформацииПоНаименованию("Телефон");
	
	ЭлектроннаяПочта = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Результат, ТипЭлектроннаяПочта, ТекущаяДатаСеанса(), Ложь);
	ЭтотОбъект.ПочтаРуководителя = ?(ЭлектроннаяПочта.Количество() > 0, ЭлектроннаяПочта[0].Представление, "");
	
	Телефон = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Результат, ТипТелефон, ТекущаяДатаСеанса(), Ложь);
	ЭтотОбъект.ТелефонРуководителя = ?(Телефон.Количество() > 0, Телефон[0].Представление, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораРуководителя(Результат, ДопПараметры=Неопределено) Экспорт
	
	Если Результат=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПослеВыбораРуководителяНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ПустаяСтрока(ИмяОбъектаРуководитель) Тогда
		Возврат
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораРуководителя", ЭтотОбъект);
	ОткрытьФорму("Справочник." + ИмяОбъектаРуководитель + ".ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ОтправитьСведенияОПродуктеНаСервере()
	
	// Производим настройку параметров подсистемы
	пр_ПоддержкаОтраслевыхРешений.ВключитьОтправкуСтатистики(ИСТИНА, ИСТИНА);
	
	// Производим отправку регистрационных данных.
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	ПараметрыПроцедуры = Новый Структура("Итератор,ОтправкаТестовогоПакета,ПолучениеИдентификатора", 0, Ложь, Истина);
	ЦентрМониторингаСлужебный.ОтправитьТестовыйПакет(ПараметрыПроцедуры, АдресРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСведенияОПродукте(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанные();
	
	ОтправитьСведенияОПродуктеНаСервере();
	
	РегистрационныеДанные = Новый Структура("РегНомер,ИНН");
	РегистрационныеДанные.РегНомер = ЭтотОбъект.РегНомер;
	РегистрационныеДанные.ИНН      = ЭтотОбъект.ИНН;
	ЭтотОбъект.Закрыть(РегистрационныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСведенияОПродукте(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанные();
	
	РегистрационныеДанные = Новый Структура("РегНомер,ИНН");
	РегистрационныеДанные.РегНомер = ЭтотОбъект.РегНомер;
	РегистрационныеДанные.ИНН      = ЭтотОбъект.ИНН;
	ЭтотОбъект.Закрыть(РегистрационныеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.ДекорацияОтправитьСведенияОПродукте.Видимость = ВозможнаОтправкаСведений;
	Элементы.ГруппаСогласиеОтправитьСведения    .Видимость = ВозможнаОтправкаСведений;
	Элементы.ОтправитьСведенияОПродукте         .Видимость = ВозможнаОтправкаСведений;
	Элементы.ДекорацияЗаписатьСведенияОПродукте .Видимость = НЕ ВозможнаОтправкаСведений;
	Элементы.ЗаписатьСведенияОПродукте          .Видимость = НЕ ВозможнаОтправкаСведений;
	
	Элементы.ОтправитьСведенияОПродукте.КнопкаПоУмолчанию = ВозможнаОтправкаСведений;
	Элементы.ЗаписатьСведенияОПродукте .КнопкаПоУмолчанию = НЕ ВозможнаОтправкаСведений;
	
	Элементы.Руководитель.Видимость = ЭтотОбъект.ПерсональнаяИнформация;
	Элементы.ТелефонПочта.Видимость = ЭтотОбъект.ПерсональнаяИнформация;
	
КонецПроцедуры // УстановитьВидимостьЭлементовФормы()

&НаСервере
Процедура ПриПолученииПараметровЛицензии(СписокЛицензий, ТипСистемыЗащиты, Серия, Наименование, Лицензия, ВерсияКомпоненты) Экспорт
	
	Если ТипСистемыЗащиты=1 Тогда
		РегНомер = ПолучитьРегНомерПоНомеруКлюча(Лицензия.KeyNo);
	ИначеЕсли Лицензия.RegNo=0 ИЛИ Лицензия.RegNo="0" Тогда
		Возврат;
	Иначе
		РегНомер = Формат(Лицензия.RegNo, "ЧГ=0");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РегНомер) Тогда
		Возврат;
	КонецЕсли;
	
	// Интересуют только основные поставки
	Если Лицензия.KeyType<>3 И СокрЛП(Лицензия.KeyType)<>"3" Тогда
		Возврат;
	КонецЕсли;
	
	НазваниеЛицензии = ?(ЗначениеЗаполнено(Лицензия.ArticleName), Лицензия.ArticleName, ?(ЗначениеЗаполнено(Лицензия.ProductName), Лицензия.ProductName, Наименование));
	СписокЛицензий.Добавить(РегНомер, РегНомер + " " + НазваниеЛицензии);
	
КонецПроцедуры // ПриПолученииПараметровЛицензии()

&НаСервере
Функция ПолучитьРегНомерПоНомеруКлюча(НомерСерии, ПрефиксСН="2190")
	
	КоличествоСимволов = СтрДлина(ПрефиксСН);
	ДлинаНомера = 12 - КоличествоСимволов;
	ФорматнаяСтрока = "ЧЦ="+ Строка(ДлинаНомера) +"; ЧВН=; ЧГ=0";
	ТекущийНомерСерии = Формат(НомерСерии, ФорматнаяСтрока);
	ТекущийНомерСерии = ПрефиксСН + ТекущийНомерСерии;
	ТекущийНомерСерии = ТекущийНомерСерии + КонтрольныйСимволEAN(ТекущийНомерСерии,13);
	
	Возврат ТекущийНомерСерии
	
КонецФункции // ПолучитьРегНомерПоНомеруКлюча()

&НаСервере
Функция КонтрольныйСимволEAN(ШтрихКод, Тип)

	Четн   = 0;
	Нечетн = 0;
	// функция работоспособна в предположении что длина ШтрихКод:
	// 7,8 или 12 цифр
	ЦифрВШтрихкоде = СтрДлина(ШтрихКод);
	Если Тип = 13 И ЦифрВШтрихкоде <> 12 Тогда
		Возврат "";
	КонецЕсли;
	Если Тип = 8 И
		(ЦифрВШтрихкоде > 8 ИЛИ ЦифрВШтрихкоде < 7) Тогда
		Возврат "";
	КонецЕсли;
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Число(Сред(ШтрихКод, 2 * Индекс, 1));
		КонецЕсли;
		Нечетн = Нечетн + Число(Сред(ШтрихКод, 2 * Индекс - 1, 1));
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции // КонтрольныйСимволEAN()

&НаКлиентеНаСервереБезКонтекста
Функция РегНомерСоответствуетТребованиям(РегНомер, КонтрольКорректностиКодов, ТекстСообщения = "")
	
	Если ПустаяСтрока(РегНомер) ИЛИ НЕ КонтрольКорректностиКодов Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Для Сч=1 По СтрДлина(РегНомер) Цикл
		Если СтрНайти("0123456789", Сред(РегНомер, Сч, 1))=0 Тогда
			ТекстСообщения = НСтр("ru = 'Регистрационный номер должен состоять только из цифр.'");
			Возврат ЛОЖЬ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИСТИНА;
	
КонецФункции // РегНомерСоответствуетТребованиям()

&НаКлиентеНаСервереБезКонтекста
Функция ИННСоответствуетТребованиям(ИНН, КонтрольКорректностиКодов, ТекстСообщения = "")
	
	Если ПустаяСтрока(ИНН) ИЛИ НЕ КонтрольКорректностиКодов Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ЭтоЮридическоеЛицо = (СтрДлина(СокрЛП(ИНН))<>12);
	
	Если НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, ЭтоЮридическоеЛицо, ТекстСообщения) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Возврат ИСТИНА;
	
КонецФункции // ИННСоответствуетТребованиям()

&НаКлиентеНаСервереБезКонтекста
Функция КППСоответствуетТребованиям(КПП, КонтрольКорректностиКодов, ТекстСообщения = "")
	
	ТекстСообщения = "";
	
	Если ПустаяСтрока(КПП) ИЛИ НЕ КонтрольКорректностиКодов Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(КПП, ТекстСообщения) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Возврат ИСТИНА;
	
КонецФункции // КППСоответствуетТребованиям()

&НаСервере
Процедура ПрочитатьДанные()
	
	// Получение данных из безопасного храниилища
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		
		// Получаем идентификатор записи в безопасное хранилище
		МодульИнтернетПоддержкаПользователей = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
		ИдентификаторПодсистемыБИП = МодульИнтернетПоддержкаПользователей.ИдентификаторПодсистемы();
		
		// Получаем РегНомер, ИНН и КПП
		ЭтотОбъект.РегНомер = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИдентификаторПодсистемыБИП, "regnumber");
		ЭтотОбъект.ИНН      = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИдентификаторПодсистемыБИП, "inn");
		ЭтотОбъект.КПП      = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИдентификаторПодсистемыБИП, "kpp");
		
		// Получаем логин ИТС
		ДанныеАутентификации = МодульИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
		Если ТипЗнч(ДанныеАутентификации)=Тип("Структура") Тогда
			ДанныеАутентификации.Свойство("Логин", ЭтотОбъект.ЛогинИТС);
		КонецЕсли;
		
	КонецЕсли;
	
	// Читаем сохраненные регистрационные данных из параметров
	РегистрацияПродукта = пр_ПоддержкаОтраслевыхРешений.ПрочитатьРегистрациюПродукта();
	
	// Корректируем ранее полученные значения
	Если ПустаяСтрока(ЭтотОбъект.РегНомер) Тогда
		РегистрацияПродукта.Свойство("РегНомер", ЭтотОбъект.РегНомер);
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.ИНН) Тогда
		РегистрацияПродукта.Свойство("ИНН", ЭтотОбъект.ИНН);
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.КПП) Тогда
		РегистрацияПродукта.Свойство("КПП", ЭтотОбъект.КПП);
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.ЛогинИТС) Тогда
		РегистрацияПродукта.Свойство("ИТС", ЭтотОбъект.ЛогинИТС);
	КонецЕсли;
	
	// Производим заполнение полей из свойств Центра мониторинга
	РегистрацияПродукта.Свойство("Аккаунт",          ЭтотОбъект.ЛогинРарус);
	РегистрацияПродукта.Свойство("Партнер",          ЭтотОбъект.Партнер);
	РегистрацияПродукта.Свойство("ДатаПриобретения", ЭтотОбъект.ДатаПриобретения);
	РегистрацияПродукта.Свойство("КонтактноеЛицо",   ЭтотОбъект.Руководитель);
	РегистрацияПродукта.Свойство("НомерТелефона",    ЭтотОбъект.ТелефонРуководителя);
	РегистрацияПродукта.Свойство("ЭлектроннаяПочта", ЭтотОбъект.ПочтаРуководителя);
	
	// Установим вручную отметку незаполненного для полей формы
	Элементы.РегНомер.ОтметкаНезаполненного = ПустаяСтрока(ЭтотОбъект.РегНомер);
	Элементы.ИНН     .ОтметкаНезаполненного = ПустаяСтрока(ЭтотОбъект.ИНН);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанные()
	
	// Регистрируем событие
	пр_ПоддержкаОтраслевыхРешений.ЗаписатьОперациюБизнесСтатистики("ПоддержкаОтраслевыхРешений.РегистрацияПродукта");
	
	// Производим сохранение регистрационных данных
	РегистрацияПродукта = Новый Структура();
	РегистрацияПродукта.Вставить("РегНомер",         СокрЛП(ЭтотОбъект.РегНомер));
	РегистрацияПродукта.Вставить("ИНН",              СокрЛП(ЭтотОбъект.ИНН));
	РегистрацияПродукта.Вставить("КПП",              СокрЛП(ЭтотОбъект.КПП));
	РегистрацияПродукта.Вставить("Партнер",          СокрЛП(ЭтотОбъект.Партнер));
	РегистрацияПродукта.Вставить("ДатаПриобретения", ЭтотОбъект.ДатаПриобретения);
	РегистрацияПродукта.Вставить("КонтактноеЛицо",   СокрЛП(ЭтотОбъект.Руководитель));
	РегистрацияПродукта.Вставить("НомерТелефона",    СокрЛП(ЭтотОбъект.ТелефонРуководителя));
	РегистрацияПродукта.Вставить("ЭлектроннаяПочта", СокрЛП(ЭтотОбъект.ПочтаРуководителя));
	РегистрацияПродукта.Вставить("Аккаунт",          СокрЛП(ЭтотОбъект.ЛогинРарус));
	РегистрацияПродукта.Вставить("ИТС",              СокрЛП(ЭтотОбъект.ЛогинИТС));
	РегистрацияПродукта.Вставить("СогласиеДано",     СогласиеОтправитьСведенияОПродукте);
	пр_ПоддержкаОтраслевыхРешений.ЗаписатьРегистрациюПродукта(РегистрацияПродукта);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыОрганизации(Организация)
	
	ПараметрыОрганизации = Новый Структура("ИНН,КПП,Руководитель,ТелефонРуководителя");
	
	ОбъектМетаданныхОрганизации = Метаданные.НайтиПоПолномуИмени("Справочник.Организации");
	ЕстьОрганизации             = (ОбъектМетаданныхОрганизации<>Неопределено);
	ЕстьРеквизитИНН             = (ЕстьОрганизации И ОбъектМетаданныхОрганизации.Реквизиты.Найти("ИНН") <> Неопределено);
	ЕстьРеквизитКПП             = (ЕстьОрганизации И ОбъектМетаданныхОрганизации.Реквизиты.Найти("КПП") <> Неопределено);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Организации") Тогда
		
		МодульОрганизацииСервер = ОбщегоНазначения.ОбщийМодуль("ОрганизацииСервер");
		
		РегистрационныеДанные = МодульОрганизацииСервер.РегистрационныеДанныеОрганизации(Организация, "ИНН, КПП");
		РегистрационныеДанные.Свойство("ИНН", ПараметрыОрганизации.ИНН);
		РегистрационныеДанные.Свойство("КПП", ПараметрыОрганизации.КПП);
		
		ДанныеРуководителя = МодульОрганизацииСервер.РегистрационныеДанныеРуководителяОрганизации(Организация, "РуководительФИО, РуководительТелефон");
		ДанныеРуководителя.Свойство("РуководительФИО",     ПараметрыОрганизации.Руководитель);
		ДанныеРуководителя.Свойство("РуководительТелефон", ПараметрыОрганизации.ТелефонРуководителя);
		
	КонецЕсли;
	
	Если ПустаяСтрока(ПараметрыОрганизации.ИНН) И ЕстьРеквизитИНН Тогда
		ПараметрыОрганизации.ИНН = Организация.ИНН;
	КонецЕсли;
	
	Если ПустаяСтрока(ПараметрыОрганизации.КПП) И ЕстьРеквизитКПП Тогда
		ПараметрыОрганизации.КПП = Организация.КПП;
	КонецЕсли;
	
	Возврат ПараметрыОрганизации;
	
КонецФункции

#КонецОбласти
